{
    "academic": {
        "degrees": [{
            "name": "Máster Frontend UX (Lemoncode)",
            "location": "Lemoncode",
            "date": "Septiembre 2021 - Actualidad"
        }, {
            "name": "Grado Ingeniería de la Salud (Universidad de Málaga)",
            "location": "Universidad de Málaga",
            "date": "Septiembre 2013 - Septiembre 2017"
        }],
        "languages": [
            {
                "name": "Español",
                "description": "Lengua materna"
            }, {
                "name":"B2 First - Score 177",
                "description": "Cambridge Assessment English",
                "date": "Jul 2021"
            }

        ],
        "projects": [
            {
               "name": "Seminario en optimización para la reconstrucción de redes génicas",
               "fecha": "2015",
               "location": "Universidad de Málaga",
                "description": "Asistencia a un seminario proporcionado por la Universidad de Málaga Seminario realizado con una duración de tres meses relacionado con la optimización en la reconstrucción de redes génicas haciendo uso de metaheurística"
                    
            }, {
                "name": "Desarrollo de una aplicación Android",
                "fecha": "2016",
                "location": "Universidad de Málaga",
                "description": "Aplicación Android para pacientes con EPOC 2016(4 meses) Se participó en el desarrollo de una aplicación Android destinada a mejorar la adhesión al tratamiento en paciente con Enfermedad Pulmonar Obstructiva Crónica (EPOC). Posteriormente se presentó dicha aplicación en el Reto Salud Andalucía."
            },
            {
                "name": "Proyecto Innovación educativa en Biología y Ciencias Ómicas",
                "fecha": "2016",
                "location": "Universidad de Málaga",
                "description": "Estudio sobre problemas de inferencia filogenética realizado para la Universidad de Málaga 2016"
            }, {
                "name": "Aplicación para la generación de mapas de calor",
                "fecha": "2017-2018",
                "location": "Universidad de Málaga",
                "description": "Desarrollo de una aplicación iniciado a partir de un Proyecto de Investigación. A partir de la Beca realizada surgió el diseño, desarrollo y mantenimiento de una aplicación destinada a la generación de mapas de calor a partir de datos de expresión génica para cualquier tipo de análisis clínico posterior a realizar."
            }
        ]
    },
    "experience": {
        "jobs": [
            {
                "role": "Desarrolladora Front-end",
                "date": "Feb 2020 - Actualidad",
                "company": "Itrs Group",
                "description": "Desarrollo front-end de herramientas de monitorización usando React, (con Redux en casos puntuales y necesarios) y javascript."
            }, {
                "role": "Desarrolladora Full-Stack",
                "date": "Abr 2018 - Nov 2019",
                "company": "GSL Servicios de Prevención",
                "description": "Desarrollo de una aplicación web de gestión clínica. Desarrollo del sistema al completo incluyendo gestión de servidores usando Docker Swarm y de las bases de datos con el motor MySQL. Un backend y frontend diferenciados, usando en ambos casos JavaScript y Rest. El frontend se desarrolló usando React, Redux y Webpack. El backend usando nodeJS con un servidor express y webpack."
            }, {
                "role": "Desarrolladora Full-Stack",
                "date": "Ene 2017 - Abr 2018",
                "company": "Grupo AL",
                "description": "Creación de proyectos cuyo objetivo era la refactorización de servicios ya existentes del Portal de Administrinación Electrónica pudiendo migrar su uso a un entorno tecnológico más actualizado y accesible. Se migraron servicios SOAP a servicios REST haciendo uso de J2EE, autenticación con JWT, base de datos MySQL y gestión de certificados electrónicos en servidores de aplicaciones Wildfly. Además se realizaron tareas de DevOps, actualizando una plataforma de integración con Jenkins y creando un cliente web para un servicio REST destinado a posibilitar a cualquier desarrollador su uso sin conocimientos del funcionamiento interno de la misma."
            }, {
                "role": "Desarrolladora Full-Stack",
                "date": "Sept 2016 - Ene 2018",
                "company": "Universidad de Málaga",
                "description": ""
            }
        ]
    }
}